Si6gma/FRDM-MCXA153/SDK_24/middleware/se_hostlib/sss/src/se05x/fsl_sss_se05x_apis.c
        switch (retObjectType) {
        case kSE05x_SecObjTyp_EC_KEY_PAIR:
#if SSS_HAVE_RSA
        case kSE05x_SecObjTyp_RSA_KEY_PAIR:
        case kSE05x_SecObjTyp_RSA_KEY_PAIR_CRT:
#endif
#if SSS_HAVE_SE05X_VER_GTE_07_02
        case kSE05x_SecObjTyp_EC_KEY_PAIR_NIST_P192:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_NIST_P224:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_NIST_P256:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_NIST_P384:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_NIST_P521:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_Brainpool160:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_Brainpool192:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_Brainpool224:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_Brainpool256:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_Brainpool320:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_Brainpool384:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_Brainpool512:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_Secp160k1:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_Secp192k1:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_Secp224k1:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_Secp256k1:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_BN_P256:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_ED25519:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_MONT_DH_25519:
        case kSE05x_SecObjTyp_EC_KEY_PAIR_MONT_DH_448:
#endif
            keyObject->objectType = kSSS_KeyPart_Pair;
            break;

        case kSE05x_SecObjTyp_EC_PUB_KEY:
        case kSE05x_SecObjTyp_RSA_PUB_KEY:
#if SSS_HAVE_SE05X_VER_GTE_07_02
        case kSE05x_SecObjTyp_EC_PUB_KEY_NIST_P192:
        case kSE05x_SecObjTyp_EC_PUB_KEY_NIST_P224:
        case kSE05x_SecObjTyp_EC_PUB_KEY_NIST_P256:
        case kSE05x_SecObjTyp_EC_PUB_KEY_NIST_P384:
        case kSE05x_SecObjTyp_EC_PUB_KEY_NIST_P521:
        case kSE05x_SecObjTyp_EC_PUB_KEY_Brainpool160:
        case kSE05x_SecObjTyp_EC_PUB_KEY_Brainpool192:
        case kSE05x_SecObjTyp_EC_PUB_KEY_Brainpool224:
        case kSE05x_SecObjTyp_EC_PUB_KEY_Brainpool256:
        case kSE05x_SecObjTyp_EC_PUB_KEY_Brainpool320:
        case kSE05x_SecObjTyp_EC_PUB_KEY_Brainpool384:
        case kSE05x_SecObjTyp_EC_PUB_KEY_Brainpool512:
        case kSE05x_SecObjTyp_EC_PUB_KEY_Secp160k1:
        case kSE05x_SecObjTyp_EC_PUB_KEY_Secp192k1:
        case kSE05x_SecObjTyp_EC_PUB_KEY_Secp224k1:
        case kSE05x_SecObjTyp_EC_PUB_KEY_Secp256k1:
        case kSE05x_SecObjTyp_EC_PUB_KEY_BN_P256:
        case kSE05x_SecObjTyp_EC_PUB_KEY_ED25519:
        case kSE05x_SecObjTyp_EC_PUB_KEY_MONT_DH_25519:
        case kSE05x_SecObjTyp_EC_PUB_KEY_MONT_DH_448:
#endif
            keyObject->objectType = kSSS_KeyPart_Public;
            break;

#if SSS_HAVE_SE05X_VER_GTE_07_02
        case kSE05x_SecObjTyp_EC_PRIV_KEY_NIST_P192:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_NIST_P224:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_NIST_P256:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_NIST_P384:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_NIST_P521:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_Brainpool160:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_Brainpool192:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_Brainpool224:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_Brainpool256:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_Brainpool320:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_Brainpool384:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_Brainpool512:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_Secp160k1:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_Secp192k1:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_Secp224k1:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_Secp256k1:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_BN_P256:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_ED25519:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_MONT_DH_25519:
        case kSE05x_SecObjTyp_EC_PRIV_KEY_MONT_DH_448:
            keyObject->objectType = kSSS_KeyPart_Private;
            break;
#endif

        case kSE05x_SecObjTyp_BINARY_FILE:
        case kSE05x_SecObjTyp_PCR:
        case kSE05x_SecObjTyp_AES_KEY:
        case kSE05x_SecObjTyp_DES_KEY:
        case kSE05x_SecObjTyp_HMAC_KEY:
        case kSE05x_SecObjTyp_COUNTER:
        case kSE05x_SecObjTyp_UserID:
            keyObject->objectType = kSSS_KeyPart_Default;
            break;
        default:
            return kStatus_SSS_Fail;
        }
    }
    else {
        LOG_W("Error in Se05x_API_ReadType. Further use of object may fail");
        if (apiRetval == SM_ERR_APDU_THROUGHPUT) {
            retval = kStatus_SSS_ApduThroughputError;
        }
        else {
            retval = kStatus_SSS_Success;
        }
        return retval;
    }

    retval = kStatus_SSS_Success;
#endif // SSSFTR_SE05X_KEY_GET
    return retval;
}

// LCOV_EXCL_START
sss_status_t sss_se05x_key_object_set_user(sss_se05x_object_t *keyObject, uint32_t user, uint32_t options)
{
    sss_status_t retval = kStatus_SSS_Fail;
    AX_UNUSED_ARG(keyObject);
    AX_UNUSED_ARG(user);
    AX_UNUSED_ARG(options);
    /* Purpose / Policy is set during creation time and hence can not
     * enforced in SE050 later on */
    LOG_W("Not supported in SE05X");
    return retval;
}

sss_status_t sss_se05x_key_object_set_purpose(sss_se05x_object_t *keyObject, sss_mode_t purpose, uint32_t options)
{
    sss_status_t retval = kStatus_SSS_Fail;
    AX_UNUSED_ARG(keyObject);
    AX_UNUSED_ARG(purpose);
    AX_UNUSED_ARG(options);
    /* Purpose / Policy is set during creation time and hence can not
     * enforced in SE050 later on */
    LOG_W("Not supported in SE05X");
    return retval;
}

sss_status_t sss_se05x_key_object_set_access(sss_se05x_object_t *keyObject, uint32_t access, uint32_t options)
{
    sss_status_t retval = kStatus_SSS_Fail;
    AX_UNUSED_ARG(keyObject);
    AX_UNUSED_ARG(access);
    AX_UNUSED_ARG(options);
    LOG_W("Not supported in SE05X");
    return retval;
}

sss_status_t sss_se05x_key_object_set_eccgfp_group(sss_se05x_object_t *keyObject, sss_eccgfp_group_t *group)
{
    sss_status_t retval = kStatus_SSS_Fail;
    AX_UNUSED_ARG(keyObject);
    AX_UNUSED_ARG(group);
    LOG_W("Not supported in SE05X");
    return retval;
}

