Si6gma/FRDM-MCXA153/SDK_24/middleware/se_hostlib/sss/src/se05x/fsl_sss_se05x_apis.c
    ENSURE_OR_GO_EXIT(digestMode != kSE05x_DigestMode_NA);

    status = Se05x_API_HKDF_Extended(&context->session->s_ctx,
        context->keyObject->keyId,
        digestMode,
        hkdfMode,
        NULL,
        0,
        saltID,
        info,
        infoLen,
        derivedKeyID,
        deriveDataLen,
        pHkdfKey,
        &hkdfKeyLen);
    ENSURE_OR_GO_EXIT(status == SM_OK);

    if (pHkdfKey != NULL) {
        if (derivedKeyObject != NULL) {
            retval = sss_key_store_set_key((sss_key_store_t *)derivedKeyObject->keyStore,
                sss_derived_keyObject,
                hkdfKey,
                hkdfKeyLen,
                hkdfKeyLen * 8,
                NULL,
                0);
            ENSURE_OR_GO_EXIT(retval == kStatus_SSS_Success);
        }
    }

    retval = kStatus_SSS_Success;
exit:
    if (status == SM_ERR_APDU_THROUGHPUT) {
        retval = kStatus_SSS_ApduThroughputError;
    }
    return retval;
}

sss_status_t sss_se05x_derive_key_dh(
    sss_se05x_derive_key_t *context, sss_se05x_object_t *otherPartyKeyObject, sss_se05x_object_t *derivedKeyObject)
{
    sss_status_t retval = kStatus_SSS_Fail;
    smStatus_t status   = SM_NOT_OK;
    uint8_t pubkey[256] = {0};
    size_t pubkeylen    = sizeof(pubkey);
    uint8_t sharedsecret[256];
    size_t sharedsecretLen  = sizeof(sharedsecret);
    size_t pbKeyBitLen      = 0;
    uint8_t *pPublicKey     = NULL;
    size_t publicKeyLen     = 0;
    uint16_t publicKeyIndex = 0;
#if SSS_HAVE_EC_MONT
    uint8_t swapByte = 0;
#endif
#if SSS_HAVE_SE05X_VER_GTE_07_02
    uint8_t invertEndiannes = 0x00;
#endif

    sss_object_t *sss_other_keyObject   = NULL;
    sss_object_t *sss_derived_keyObject = NULL;
    ENSURE_OR_GO_EXIT(context);
    ENSURE_OR_GO_EXIT(otherPartyKeyObject);
    ENSURE_OR_GO_EXIT(derivedKeyObject);
    sss_other_keyObject   = (sss_object_t *)otherPartyKeyObject;
    sss_derived_keyObject = (sss_object_t *)derivedKeyObject;
    retval                = sss_key_store_get_key(
        (sss_key_store_t *)sss_other_keyObject->keyStore, sss_other_keyObject, pubkey, &pubkeylen, &pbKeyBitLen);
    ENSURE_OR_GO_EXIT(retval == kStatus_SSS_Success);

    retval =
        sss_util_pkcs8_asn1_get_ec_public_key_index((const uint8_t *)pubkey, pubkeylen, &publicKeyIndex, &publicKeyLen);
    if (retval != kStatus_SSS_Success) {
        LOG_W("error in sss_util_pkcs8_asn1_get_ec_public_key_index");
        goto exit;
    }

#if SSS_HAVE_EC_MONT
    // Change Endianness Public Key in case of Montgomery Curve
    {
        if (otherPartyKeyObject->cipherType == kSSS_CipherType_EC_MONTGOMERY) {
            for (size_t keyValueIdx = 0; keyValueIdx < (publicKeyLen >> 1); keyValueIdx++) {
                ENSURE_OR_GO_EXIT((UINT_MAX - publicKeyIndex) >= keyValueIdx);
                swapByte                             = pubkey[publicKeyIndex + keyValueIdx];
                pubkey[publicKeyIndex + keyValueIdx] = pubkey[publicKeyIndex + publicKeyLen - 1 - keyValueIdx];
                ENSURE_OR_GO_EXIT((UINT_MAX - publicKeyIndex) >= publicKeyLen);
                pubkey[publicKeyIndex + publicKeyLen - 1 - keyValueIdx] = swapByte;
            }
        }
    }
#endif
    if (pubkeylen > publicKeyIndex) {
        pPublicKey = &pubkey[publicKeyIndex];
    }
    else {
        goto exit;
    }
#if SSS_HAVE_SE05X_VER_GTE_07_02
#if SSS_HAVE_EC_MONT
    if (otherPartyKeyObject->cipherType == kSSS_CipherType_EC_MONTGOMERY) {
        // In case of Montgomery curves we want to store the
        // shared secret using Little Endian Convention
        invertEndiannes = 0x01;
    }
#endif

    if (context->keyObject->keyStore->session->subsystem == derivedKeyObject->keyStore->session->subsystem) {
        status = Se05x_API_ECDHGenerateSharedSecret_InObject(&context->session->s_ctx,
            context->keyObject->keyId,
            pPublicKey,
            publicKeyLen,
            derivedKeyObject->keyId,
            invertEndiannes);
        if (status != SM_OK) {
            LOG_W("error in Se05x_API_ECDHGenerateSharedSecret_InObject");
            if (status == SM_ERR_APDU_THROUGHPUT) {
                retval = kStatus_SSS_ApduThroughputError;
            }
            else {
                retval = kStatus_SSS_Fail;
            }
            goto exit;
        }
    }
    else {
#endif
        status = Se05x_API_ECGenSharedSecret(&context->session->s_ctx,
            context->keyObject->keyId,
            pPublicKey,
            publicKeyLen,
            sharedsecret,
            &sharedsecretLen);
        if (status != SM_OK) {
            if (status == SM_ERR_APDU_THROUGHPUT) {
                retval = kStatus_SSS_ApduThroughputError;
            }
            else {
                retval = kStatus_SSS_Fail;
            }
            goto exit;
        }

#if SSS_HAVE_EC_MONT
        // Change Endianness Shared Secret in case of Montgomery Curve
        {
            if (otherPartyKeyObject->cipherType == kSSS_CipherType_EC_MONTGOMERY) {
                for (size_t keyValueIdx = 0; keyValueIdx < (publicKeyLen >> 1); keyValueIdx++) {
                    swapByte                                     = sharedsecret[keyValueIdx];
                    sharedsecret[keyValueIdx]                    = sharedsecret[publicKeyLen - 1 - keyValueIdx];
                    sharedsecret[publicKeyLen - 1 - keyValueIdx] = swapByte;
                }
            }
        }
#endif

        retval = sss_key_store_set_key((sss_key_store_t *)derivedKeyObject->keyStore,
            sss_derived_keyObject,
            sharedsecret,
            sharedsecretLen,
            sharedsecretLen * 8,
            NULL,
            0);
        ENSURE_OR_GO_EXIT(retval == kStatus_SSS_Success);
#if SSS_HAVE_SE05X_VER_GTE_07_02
    }
#endif

    retval = kStatus_SSS_Success;
exit:
    return retval;
}

void sss_se05x_derive_key_context_free(sss_se05x_derive_key_t *context)
{
    AX_UNUSED_ARG(context);
}

