Si6gma/FRDM-MCXA153/SDK_24/middleware/se_hostlib/sss/src/se05x/fsl_sss_se05x_apis.c
            status = Se05x_API_RSAEncrypt(&context->session->s_ctx,
                context->keyObject->keyId,
                kSE05x_RSAEncryptionAlgo_NO_PAD,
                signature,
                signatureLen,
                dec_data,
                &dec_len);
            if (status == SM_OK) {
                smStatus_t encode_ret = SM_OK;
                encode_ret = pkcs1_v15_encode(context, digest, digestLen, pkcs1v15_encode_data, &encode_data_len);
                if (SM_OK != encode_ret) {
                    if (encode_ret == SM_ERR_APDU_THROUGHPUT) {
                        return kStatus_SSS_ApduThroughputError;
                    }
                    else {
                        return kStatus_SSS_Fail;
                    }
                }

                if (memcmp(dec_data, pkcs1v15_encode_data, encode_data_len) == 0) {
                    result = kSE05x_Result_SUCCESS;
                }
            }
        }
        else if (context->algorithm == kAlgorithm_SSS_RSASSA_PKCS1_V1_5_NO_HASH) {
            /* clang-format off */
            uint8_t dec_data[512] = { 0, }; /* MAX - SHA512*/
            size_t dec_len = sizeof(dec_data);
            uint8_t pkcs1v15_encode_data[512] = { 0, }; /* MAX - SHA512*/
            size_t encode_data_len = sizeof(pkcs1v15_encode_data);
            /* clang-format on */

            status = Se05x_API_RSAEncrypt(&context->session->s_ctx,
                context->keyObject->keyId,
                kSE05x_RSAEncryptionAlgo_NO_PAD,
                signature,
                signatureLen,
                dec_data,
                &dec_len);
            if (status == SM_OK) {
                smStatus_t encode_ret = SM_OK;
                encode_ret =
                    pkcs1_v15_encode_no_hash(context, digest, digestLen, pkcs1v15_encode_data, &encode_data_len);
                if (SM_OK != encode_ret) {
                    if (encode_ret == SM_ERR_APDU_THROUGHPUT) {
                        return kStatus_SSS_ApduThroughputError;
                    }
                    else {
                        return kStatus_SSS_Fail;
                    }
                }

                if (memcmp(dec_data, pkcs1v15_encode_data, encode_data_len) == 0) {
                    result = kSE05x_Result_SUCCESS;
                }
            }
        }
        else if (context->algorithm == kAlgorithm_SSS_RSASSA_NO_PADDING) {
            uint8_t dec_data[512] = {
                0,
            }; /*MAX - RSA4096*/
            uint8_t padded_data[512]     = {0};
            size_t dec_len               = sizeof(dec_data);
            size_t padded_len            = sizeof(padded_data);
            size_t parsedKeyByteLen      = 0;
            uint16_t u16parsedKeyByteLen = 0;

            status = Se05x_API_RSAEncrypt(&context->session->s_ctx,
                context->keyObject->keyId,
                kSE05x_RSAEncryptionAlgo_NO_PAD,
                signature,
                signatureLen,
                dec_data,
                &dec_len);
            if (status == SM_OK) {
                status = Se05x_API_ReadSize(&context->session->s_ctx, context->keyObject->keyId, &u16parsedKeyByteLen);
                if (status == SM_OK) {
                    parsedKeyByteLen = u16parsedKeyByteLen;
                    if (status != SM_OK) {
                        return kStatus_SSS_Fail;
                    }

                    if (digestLen <= parsedKeyByteLen && digestLen > 0) {
                        memset(padded_data, 0x00, padded_len);
                        memcpy(&padded_data[parsedKeyByteLen - digestLen], &digest[0], digestLen);
                        padded_len = parsedKeyByteLen;
                    }

                    else {
                        return kStatus_SSS_Fail;
                    }

                    if (memcmp(&dec_data[0], &padded_data[0], padded_len) == 0) {
                        result = kSE05x_Result_SUCCESS;
                    }
                }
            }
        }
        else {
            LOG_E("Selected padding is not supported for RSA Sign in SE050");
            return kStatus_SSS_Fail;
        }

    } break;
#endif // SSSFTR_SE05X_RSA && SSS_HAVE_RSA && !SSS_HAVE_HOSTCRYPTO_NONE
    default:
        break;
    }
#endif // SSSFTR_SE05X_ECC || SSSFTR_SE05X_RSA

#if SSSFTR_SE05X_ECC || SSSFTR_SE05X_RSA
    if (status == SM_OK) {
        if (result == kSE05x_Result_SUCCESS) {
            retval = kStatus_SSS_Success;
        }
    }
    if (status == SM_ERR_APDU_THROUGHPUT) {
        retval = kStatus_SSS_ApduThroughputError;
    }
#endif // SSSFTR_SE05X_ECC || SSSFTR_SE05X_RSA

    return retval;
}

sss_status_t sss_se05x_asymmetric_verify(sss_se05x_asymmetric_t *context,
    const uint8_t *srcData,
    size_t srcLen,
    const uint8_t *signature,
    size_t signatureLen)
{
    sss_status_t retval = kStatus_SSS_Fail;
#if (SSSFTR_SE05X_RSA && SSS_HAVE_RSA) || (SSSFTR_SE05X_ECC && SSS_HAVE_EC_ED)
    smStatus_t status     = SM_NOT_OK;
    SE05x_Result_t result = kSE05x_Result_FAILURE;
#endif

    switch (context->keyObject->cipherType) {
#if SSSFTR_SE05X_RSA && SSS_HAVE_RSA
    case kSSS_CipherType_RSA:
    case kSSS_CipherType_RSA_CRT: {
        SE05x_RSASignatureAlgo_t rsaSigningAlgo = se05x_get_rsa_sign_hash_mode(context->algorithm);
        uint16_t key_size_bytes                 = 0;

        if (context->algorithm == kAlgorithm_SSS_RSASSA_PKCS1_V1_5_SHA512 ||
            context->algorithm == kAlgorithm_SSS_RSASSA_PKCS1_PSS_MGF1_SHA512) {
            status = Se05x_API_ReadSize(&context->session->s_ctx, context->keyObject->keyId, &key_size_bytes);
            if (status == SM_ERR_APDU_THROUGHPUT) {
                return kStatus_SSS_ApduThroughputError;
            }
            if (status != SM_OK) {
                return kStatus_SSS_Fail;
            }

            if ((key_size_bytes * 8) == 512) {
                return kStatus_SSS_Fail;
            }
        }

        status = Se05x_API_RSAVerify(&context->session->s_ctx,
            context->keyObject->keyId,
            rsaSigningAlgo,
            srcData,
            srcLen,
            signature,
            signatureLen,
            &result);
    } break;
#endif // SSSFTR_SE05X_RSA && SSS_HAVE_RSA
#if SSSFTR_SE05X_ECC && SSS_HAVE_EC_ED
    case kSSS_CipherType_EC_TWISTED_ED: {
#ifdef TMP_ENDIAN_VERBOSE
        {
            printf("Signature before Reverse:\n");
            for (size_t z = 0; z < signatureLen; z++) {
                printf("%02X.", signature[z]);
            }
            printf("\n");
        }
#endif

        // Revert Endianness
        uint8_t signature_temp[64] = {0};
        size_t offset              = 0;

        if (signatureLen <= sizeof(signature_temp)) {
            memcpy(signature_temp, &signature[0], signatureLen);
        }
        else {
            return kStatus_SSS_Fail;
        }

        for (size_t keyValueIdx = 0; keyValueIdx < (signatureLen >> 2); keyValueIdx++) {
            uint8_t swapByte = signature_temp[keyValueIdx];
            if (offset + (signatureLen >> 1) - 1 - keyValueIdx < signatureLen) {
                signature_temp[offset + keyValueIdx] = signature_temp[offset + (signatureLen >> 1) - 1 - keyValueIdx];
                signature_temp[offset + (signatureLen >> 1) - 1 - keyValueIdx] = swapByte;
            }
            else {
                return kStatus_SSS_Fail;
            }
        }

