Si6gma/FRDM-MCXA153/SDK_24/middleware/se_hostlib/sss/src/se05x/fsl_sss_se05x_apis.c
    status = sss_digest_context_init(&digest_ctx, pHostSession, digest_algorithm, kMode_SSS_Digest);
    ENSURE_OR_GO_CLEANUP(status == kStatus_SSS_Success);
#if SSS_HAVE_SE05X_VER_GTE_07_02
    status = sss_digest_one_go(&digest_ctx, pCapdu, cApduLen, digest, &digestLen);
    ENSURE_OR_GO_CLEANUP(status == kStatus_SSS_Success);

    ENSURE_OR_GO_CLEANUP(digestLen <= sizeof(inputData));
    memcpy(inputData, digest, digestLen);
    inputDataLen += digestLen;
#endif // SSS_HAVE_SE05X_VER_GTE_07_02

    ENSURE_OR_GO_CLEANUP((SIZE_MAX - rspLen) >= inputDataLen);
    ENSURE_OR_GO_CLEANUP((rspLen + inputDataLen) <= sizeof(inputData));
    memcpy(inputData + inputDataLen, pRsp, rspLen);
    inputDataLen += rspLen;

    status = sss_digest_one_go(&digest_ctx, inputData, inputDataLen, digest, &digestLen);
    ENSURE_OR_GO_CLEANUP(status == kStatus_SSS_Success);

    status = sss_asymmetric_context_init(
        &asymm_ctx, pHostSession, pAttestKeyObject, kAlgorithm_SSS_SHA256, kMode_SSS_Verify);
    ENSURE_OR_GO_CLEANUP(status == kStatus_SSS_Success);

    status = sss_asymmetric_verify_digest(&asymm_ctx, digest, digestLen, pSignature, signatureLen);
    ENSURE_OR_GO_CLEANUP(status == kStatus_SSS_Success);

cleanup:
    sss_digest_context_free(&digest_ctx);
    sss_asymmetric_context_free(&asymm_ctx);
    return status;
}

sss_status_t nxECKey_ReadEckaPublicKey(pSe05xSession_t se05xSession,
    sss_key_store_t *pHostKeyStore,
    uint8_t *pSePubEcka,
    size_t *pSePubEckaLen,
    uint32_t eckaObjId)
{
    sss_status_t status = kStatus_SSS_Fail;
    smStatus_t sm_status;
    sss_object_t hostAttestObj         = {0};
    sss_rng_context_t rng_ctx          = {0};
    SE05x_AttestationAlgo_t attestAlgo = kSE05x_AttestationAlgo_EC_SHA_256;
    sss_se05x_attst_data_t att_data    = {.valid_number = 2};
    uint8_t *key                       = pSePubEcka;
    uint8_t random[16]                 = {0};
    size_t randomLen                   = sizeof(random);
    uint8_t rspBuf[250]                = {0};
    uint8_t *pRspBuf                   = &rspBuf[0];
    size_t rspBufLen                   = 0;
#if SSS_HAVE_SE05X_VER_GTE_07_02
    uint8_t objectSize[] = {0x00, 0x20};
    size_t objectSizeLen = sizeof(objectSize);
    int tlvRet           = 0;
#endif // SSS_HAVE_SE05X_VER_GTE_07_02

    status = nxECKey_StoreAttestationPublicKey(se05xSession, pHostKeyStore, &hostAttestObj);
    ENSURE_OR_GO_CLEANUP(status == kStatus_SSS_Success);

    status = sss_rng_context_init(&rng_ctx, pHostKeyStore->session);
    ENSURE_OR_GO_CLEANUP(status == kStatus_SSS_Success);
    status = sss_rng_get_random(&rng_ctx, random, randomLen);
    ENSURE_OR_GO_CLEANUP(status == kStatus_SSS_Success);
    status = sss_rng_context_free(&rng_ctx);
    ENSURE_OR_GO_CLEANUP(status == kStatus_SSS_Success);

    att_data.data[0].timeStampLen = sizeof(SE05x_TimeStamp_t);
    att_data.data[0].chipIdLen    = sizeof(att_data.data[0].chipId);
    att_data.data[0].attributeLen = sizeof(att_data.data[0].attribute);
    att_data.data[0].signatureLen = sizeof(att_data.data[0].signature);

#if SSS_HAVE_SE05X_VER_GTE_07_02
    att_data.data[0].cmdLen = sizeof(att_data.data[0].cmd);
#else
    att_data.data[0].outrandomLen = sizeof(att_data.data[0].outrandom);
#endif // SSS_HAVE_SE05X_VER_GTE_07_02

    status = kStatus_SSS_Fail;
#if SSS_HAVE_SE05X_VER_GTE_07_02
    sm_status = Se05x_API_ReadObject_W_Attst_V2(se05xSession,
        eckaObjId,
        0,
        0,
        SSS_SE05X_RESID_ATTESTATION_KEY,
        attestAlgo,
        random,
        randomLen,
        key,
        pSePubEckaLen,
        att_data.data[0].attribute,
        &att_data.data[0].attributeLen,
        &att_data.data[0].timeStamp,
        att_data.data[0].chipId,
        &att_data.data[0].chipIdLen,
        att_data.data[0].cmd,
        &att_data.data[0].cmdLen,
        objectSize,
        &objectSizeLen,
        att_data.data[0].signature,
        &att_data.data[0].signatureLen);
#else
    sm_status = Se05x_API_ReadObject_W_Attst(se05xSession,
        eckaObjId,
        0,
        0,
        SSS_SE05X_RESID_ATTESTATION_KEY,
        attestAlgo,
        random,
        randomLen,
        key,
        pSePubEckaLen,
        att_data.data[0].attribute,
        &att_data.data[0].attributeLen,
        &att_data.data[0].timeStamp,
        att_data.data[0].outrandom,
        &att_data.data[0].outrandomLen,
        att_data.data[0].chipId,
        &att_data.data[0].chipIdLen,
        att_data.data[0].signature,
        &att_data.data[0].signatureLen);
#endif // SSS_HAVE_SE05X_VER_GTE_07_02
    if (sm_status == SM_ERR_APDU_THROUGHPUT) {
        status = kStatus_SSS_ApduThroughputError;
        goto cleanup;
    }
    ENSURE_OR_GO_CLEANUP(sm_status == SM_OK);

#if SSS_HAVE_SE05X_VER_GTE_07_02
    ENSURE_OR_GO_CLEANUP(
        ((1 + *pSePubEckaLen + 3) + (1 + att_data.data[0].chipIdLen + 3) + (1 + att_data.data[0].attributeLen + 3) +
            (1 + sizeof(objectSize) + 3) + (1 + sizeof(att_data.data[0].timeStamp) + 3)) <= sizeof(rspBuf));
    tlvRet = add_taglength_to_data(&pRspBuf, &rspBufLen, kSE05x_TAG_1, key, *pSePubEckaLen, true);
    ENSURE_OR_GO_CLEANUP(tlvRet == 0);
    tlvRet = add_taglength_to_data(
        &pRspBuf, &rspBufLen, kSE05x_TAG_2, att_data.data[0].chipId, att_data.data[0].chipIdLen, true);
    ENSURE_OR_GO_CLEANUP(tlvRet == 0);
    tlvRet = add_taglength_to_data(
        &pRspBuf, &rspBufLen, kSE05x_TAG_3, att_data.data[0].attribute, att_data.data[0].attributeLen, true);
    ENSURE_OR_GO_CLEANUP(tlvRet == 0);
    tlvRet = add_taglength_to_data(&pRspBuf, &rspBufLen, kSE05x_TAG_4, objectSize, sizeof(objectSize), true);
    ENSURE_OR_GO_CLEANUP(tlvRet == 0);
    tlvRet = add_taglength_to_data(&pRspBuf,
        &rspBufLen,
        kSE05x_TAG_TIMESTAMP,
        att_data.data[0].timeStamp.ts,
        sizeof(att_data.data[0].timeStamp),
        true);
    ENSURE_OR_GO_CLEANUP(tlvRet == 0);
#else
    ENSURE_OR_GO_CLEANUP((*pSePubEckaLen + att_data.data[0].attributeLen + att_data.data[0].timeStampLen +
                             att_data.data[0].outrandomLen + att_data.data[0].chipIdLen) <= sizeof(rspBuf))
    memcpy(pRspBuf, key, *pSePubEckaLen);
    pRspBuf += *pSePubEckaLen;
    memcpy(pRspBuf, att_data.data[0].attribute, att_data.data[0].attributeLen);
    pRspBuf += att_data.data[0].attributeLen;
    memcpy(pRspBuf, att_data.data[0].timeStamp.ts, att_data.data[0].timeStampLen);
    pRspBuf += att_data.data[0].timeStampLen;
    memcpy(pRspBuf, att_data.data[0].outrandom, att_data.data[0].outrandomLen);
    pRspBuf += att_data.data[0].outrandomLen;
    memcpy(pRspBuf, att_data.data[0].chipId, att_data.data[0].chipIdLen);
    pRspBuf += att_data.data[0].chipIdLen;

    rspBufLen = pRspBuf - (&rspBuf[0]);
#endif // SSS_HAVE_SE05X_VER_GTE_07_02

#if SSS_HAVE_SE05X_VER_GTE_07_02
    status = nxECKey_VerifyAttestation(pHostKeyStore->session,
        &hostAttestObj,
        att_data.data[0].cmd,
        att_data.data[0].cmdLen,
        rspBuf,
        rspBufLen,
        att_data.data[0].signature,
        att_data.data[0].signatureLen);
#else
    status = nxECKey_VerifyAttestation(pHostKeyStore->session,
        &hostAttestObj,
        NULL,
        0,
        rspBuf,
        rspBufLen,
        att_data.data[0].signature,
        att_data.data[0].signatureLen);
#endif // SSS_HAVE_SE05X_VER_GTE_07_02
    ENSURE_OR_GO_CLEANUP(status == kStatus_SSS_Success);

    sss_key_store_erase_key(pHostKeyStore, &hostAttestObj);
    sss_key_object_free(&hostAttestObj);

cleanup:
    return status;
}

static smStatus_t se05x_CreateECKeySession(
    pSe05xSession_t se05xSession, const uint32_t auth_id, SE05x_AuthCtx_ECKey_t *pFScpCtx)
{
    sss_status_t retval   = kStatus_SSS_Fail;
    SE05x_Result_t exists = kSE05x_Result_FAILURE;
    smStatus_t status     = SM_NOT_OK;
    size_t sessionIdLen   = 8;

    status = Se05x_API_CheckObjectExists(se05xSession, auth_id, &exists);
    if (status == SM_OK && exists == kSE05x_Result_FAILURE) {
        status = SM_NOT_OK;
        LOG_E("SE ECDSA Public Key is not Provisioned!!!");
    }
    if (status == SM_OK) {
        uint8_t sePubEcka[150] = {0};
        size_t sePubEckaLen    = sizeof(sePubEcka);
        retval                 = nxECKey_ReadEckaPublicKey(se05xSession,
            pFScpCtx->pStatic_ctx->HostEcKeypair.keyStore,
            sePubEcka,
            &sePubEckaLen,
            kSE05x_AppletResID_KP_ECKEY_USER);
        if (retval != kStatus_SSS_Success) {
            if (retval == kStatus_SSS_ApduThroughputError) {
                status = SM_ERR_APDU_THROUGHPUT;
            }
            else {
                status = SM_NOT_OK;
            }
            return status;
        }
        status = Se05x_API_CreateSession(se05xSession, auth_id, se05xSession->value, &sessionIdLen);
        if (status != SM_OK) {
            se05xSession->hasSession = 0;
        }
        else {
            status                   = SM_NOT_OK;
            se05xSession->hasSession = 1;
            retval                   = nxECKey_AuthenticateChannel(se05xSession, pFScpCtx, sePubEcka, &sePubEckaLen);
            if (retval == kStatus_SSS_Success) {
                NXSCP03_DynCtx_t *pDyn_ctx = pFScpCtx->pDyn_ctx;

                pDyn_ctx->authType = se05xSession->authType = kSSS_AuthType_ECKey;
                se05xSession->pdynScp03Ctx                  = pFScpCtx->pDyn_ctx;
                status                                      = SM_OK;
                se05xSession->auth_id                       = auth_id;
            }
            else if (retval == kStatus_SSS_ApduThroughputError) {
                status = SM_ERR_APDU_THROUGHPUT;
            }
        }
    }
    return status;
}
#endif /* SSSFTR_SE05X_AuthECKey */
#endif

#if SSSFTR_SE05X_ECC || SSSFTR_SE05X_RSA
static sss_status_t se05x_check_input_len(size_t inLen, sss_algorithm_t algorithm)
{
    sss_status_t retval = kStatus_SSS_Fail;

    switch (algorithm) {
    case kAlgorithm_SSS_SHA1:
    case kAlgorithm_SSS_ECDSA_SHA1:
#if SSS_HAVE_RSA
    case kAlgorithm_SSS_RSASSA_PKCS1_V1_5_SHA1:
    case kAlgorithm_SSS_RSASSA_PKCS1_PSS_MGF1_SHA1:
#endif
        retval = (inLen == 20) ? kStatus_SSS_Success : kStatus_SSS_Fail;
        break;
    case kAlgorithm_SSS_SHA224:
    case kAlgorithm_SSS_ECDSA_SHA224:
#if SSS_HAVE_RSA
    case kAlgorithm_SSS_RSASSA_PKCS1_V1_5_SHA224:
    case kAlgorithm_SSS_RSASSA_PKCS1_PSS_MGF1_SHA224:
#endif
        retval = (inLen == 28) ? kStatus_SSS_Success : kStatus_SSS_Fail;
        break;
    case kAlgorithm_SSS_SHA256:
    case kAlgorithm_SSS_ECDSA_SHA256:
#if SSS_HAVE_RSA
    case kAlgorithm_SSS_RSASSA_PKCS1_V1_5_SHA256:
    case kAlgorithm_SSS_RSASSA_PKCS1_PSS_MGF1_SHA256:
#endif
        retval = (inLen == 32) ? kStatus_SSS_Success : kStatus_SSS_Fail;
        break;
    case kAlgorithm_SSS_SHA384:
    case kAlgorithm_SSS_ECDSA_SHA384:
#if SSS_HAVE_RSA
    case kAlgorithm_SSS_RSASSA_PKCS1_V1_5_SHA384:
    case kAlgorithm_SSS_RSASSA_PKCS1_PSS_MGF1_SHA384:
#endif
        retval = (inLen == 48) ? kStatus_SSS_Success : kStatus_SSS_Fail;
        break;
    case kAlgorithm_SSS_SHA512:
    case kAlgorithm_SSS_ECDSA_SHA512:
#if SSS_HAVE_RSA
    case kAlgorithm_SSS_RSASSA_PKCS1_V1_5_SHA512:
    case kAlgorithm_SSS_RSASSA_PKCS1_PSS_MGF1_SHA512:
#endif
        retval = (inLen == 64) ? kStatus_SSS_Success : kStatus_SSS_Fail;
        break;
#if SSS_HAVE_RSA
    case kAlgorithm_SSS_RSASSA_PKCS1_V1_5_NO_HASH:
    case kAlgorithm_SSS_RSASSA_NO_PADDING:
        retval = kStatus_SSS_Success;
        break;
#endif
    default:
        LOG_E("Unkown algorithm");
        retval = kStatus_SSS_Fail;
    }
    return retval;
}
#endif

static SE05x_ECSignatureAlgo_t se05x_get_ec_sign_hash_mode(sss_algorithm_t algorithm)
{
    SE05x_ECSignatureAlgo_t mode;
    switch (algorithm) {
    case kAlgorithm_SSS_SHA1:
    case kAlgorithm_SSS_ECDSA_SHA1:
        mode = kSE05x_ECSignatureAlgo_SHA;
        break;
    case kAlgorithm_SSS_SHA224:
    case kAlgorithm_SSS_ECDSA_SHA224:
        mode = kSE05x_ECSignatureAlgo_SHA_224;
        break;
    case kAlgorithm_SSS_SHA256:
    case kAlgorithm_SSS_ECDSA_SHA256:
        mode = kSE05x_ECSignatureAlgo_SHA_256;
        break;
    case kAlgorithm_SSS_SHA384:
    case kAlgorithm_SSS_ECDSA_SHA384:
        mode = kSE05x_ECSignatureAlgo_SHA_384;
        break;
    case kAlgorithm_SSS_SHA512:
    case kAlgorithm_SSS_ECDSA_SHA512:
        mode = kSE05x_ECSignatureAlgo_SHA_512;
        break;
    default:
        mode = kSE05x_ECSignatureAlgo_PLAIN;
        break;
    }
    return mode;
}

